IdeaRS.OpenModel.Detail.ReinfFabric
Representing fabric reinforcement in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.ReinfFabric.#ctor
constructor

IdeaRS.OpenModel.Detail.ReinfFabric.MasterComponent
Master component of reinforcement, if null, fabric reinforcement is in all components

IdeaRS.OpenModel.Detail.ReinfFabric.DiameterX
Bar diameter - direction X

IdeaRS.OpenModel.Detail.ReinfFabric.DiameterY
Bar diameter - direction Y

IdeaRS.OpenModel.Detail.ReinfFabric.DistanceX
Distance between bars - direction X

IdeaRS.OpenModel.Detail.ReinfFabric.DistanceY
Distance between bars - direction Y

IdeaRS.OpenModel.Detail.ReinfFabric.SeparatelyPerWall
true - add fabric reinfrocement separatelly for each wall, false - merge walls and add reinforcement on merged shape

IdeaRS.OpenModel.Detail.ReinfFabric.Number
number of fabric in wall projection

IdeaRS.OpenModel.Detail.ReinfFabric.CoverFromSetting
Use cover from DetailModelSetting

IdeaRS.OpenModel.Detail.ReinfFabric.Cover
Cover of reinforcement

IdeaRS.OpenModel.Detail.ReinfFabric.Position
Position of bottom left corner of fabric reinforcement related to point number 1 of master wall

IdeaRS.OpenModel.Detail.ReinfFabric.Angle
Rotation of fabric reinforcement related to global X coordinate